# Итоговый проект

**Задача:**

Написать программу, которая из имеющегося массива строк, формирует массив строк, длина которых меньше либо равна 3 символа. 

**Описание работы:**

1. Объявляем метод, который принимает на вход 2 массива из строк
2. Инициируем новые переменные типа int и присваиваем 0
3. С помощью цикла for запускаем счетчик от 0 до длины массива
4. Задаем условие: если длина текущей строки первого массива меньше или равна 3, то присваиваем эту строку к элементу второго массива
5. Объявляем следующий метод для печати массива на консоль, который принимает на вход массив 
6. С помощью цикла for запускаем счетчик от 0 до длины массива
7. С помощью встроенной функции Console.Writeline(), двигаясь по счетчику, выводим каждую строку массива по порядку


**Ссылки для удобства:**

* [Решение задачи](task/Program.cs)
* [Блок-схема в формате .drawio](task/diagram.drawio)
* [Блок-схема в формате .png](task/diagram.png)
